src/cf/InformationRegisters/fmResponsiblesReplacements.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>fmResponsiblesReplacements</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ResponsibleReplacing</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>BeginDate</Name>
					<Comment>Дата начала действия замены</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>EndDate</Name>
					<Comment>Дата окончания действия замены</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/fmResponsiblesReplacements/Forms/RecordForm/Ext/Form/Module.bsl
&AtClient
// Процедура обработчик "ПередЗаписью" 
//
Procedure BeforeWrite(Cancel, RecordParameters)
	
	If ValueIsFilled(Record.BeginDate) AND ValueIsFilled(Record.EndDate) 
	AND Record.BeginDate > Record.EndDate Then
		CommonClientServer.MessageToUser(NStr("en='The replacement start date must be less than the end date or equal it.';ru='Дата начала замены должна быть меньше или равна дате окончания!'"), , , ,Cancel);
	EndIf;
	
	If ValueIsFilled(Record.Responsible) AND ValueIsFilled(Record.ResponsibleReplacing) 
	AND Record.Responsible = Record.ResponsibleReplacing Then
		CommonClientServer.MessageToUser(NStr("en='A responsible person and a replacement responsible person shall be different!';ru='Ответственный и заменяющий должны быть разными!'"), , , ,Cancel);
	EndIf;
	
EndProcedure
